let 자동차 = [
    {
        name:'아반떼',
        engine:'v1'
    },
    {
        name:'소나타',
        engine:'v2'
    },
    {
        name:'그랜저',
        engine:'v3'
    }
]

console.log(자동차);
console.log(자동차[2].engine);


let 자동차2 = {
    id:[1,2,3,4],
    id2:[5,6,7,8,9],
    id3:[10,11,12,13,14],
    id4:[15,16,17,18,19]
}

console.log(자동차2.id3[3]);


let 자동차3 = {
    아반떼:{
        엔진:'v3',
        바퀴:'동그라미',
        핸들:'세모',
        기어:'4단'
    },
    소나타:{
        엔진:'v1',
        바퀴:'네모',
        핸들:'동그라미',
        기어:'12단'
    }
}


console.log(자동차3.아반떼.기어);